tap "bellini666/tap", "https://github.com/bellini666/pytest-language-server", trusted: true
tap "common-fate/granted"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "k1low/tap"
tap "nikitabobko/tap"
tap "teamookla/speedtest"
# Code searching, linting, rewriting
brew "ast-grep"
# Per-project, per-directory shell environments
brew "autoenv"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Statistics utility to count lines of code
brew "cloc"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Easiest way to access your cloud
brew "granted"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Implementation of the file(1) command
brew "libmagic"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Terminal image, video, directory, and Markdown viewer
brew "mcat"
# Terminal markdown viewer
brew "mdfried"
# CLI for Mermaid library
brew "mermaid-cli"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Spec-driven development (SDD) for AI coding assistants
brew "openspec"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Terminal slideshow tool
brew "presenterm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# User interface to the TELNET protocol
brew "telnet"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Command-line interface for Vercel
brew "vercel-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Blazingly fast Language Server Protocol implementation for pytest
brew "bellini666/tap/pytest-language-server"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Terraform Language Server
brew "hashicorp/tap/terraform-ls", trusted: true
# A Git subcommand that makes `git worktree` simple
brew "k1low/tap/git-wt", trusted: true
# Ookla Speedtest
brew "teamookla/speedtest/speedtest", trusted: true
# Command-line helper for the 1Password password manager
cask "1password-cli@beta"
# Password manager
cask "1password@beta"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Utility for customizing which browser to start
cask "finicky"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# GPU-based terminal emulator
cask "kitty"
# App to manage software development and track bugs
cask "linear"
# Customise mouse behavior
cask "linearmouse"
# Support for Logitech G gear
cask "logitech-g-hub"
# Spreadsheet software
cask "microsoft-excel"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Identity verification provider
cask "okta-verify"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Video communication and virtual meeting platform
cask "zoom"
go "github.com/nitintf/claudewatch"
uv "uv-sort"
npm "prettier"
npm "yaml-language-server"
